src/Catalogs/УчетныеДанныеRDP/УчетныеДанныеRDP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеДанныеRDP</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Кластеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ШифрПароля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоменПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/РаботаСRDP/Module.bsl
// @strict-types


Функция УчетныеДаннные(Сервер) Экспорт
	
	ДанныеПоПодключению = Справочники.УчетныеДанныеRDP.ДанныеПодключенияПоСерверу(Сервер);
	
	Результат = Новый Структура;
	Результат.Вставить("Адрес", ДанныеПоПодключению.Сервер);
	Результат.Вставить("Логин", ДанныеПоПодключению.Наименование);
	Результат.Вставить("Домен", ДанныеПоПодключению.ДоменПользователя);
	Результат.Вставить("Шифр", ДанныеПоПодключению.ШифрПароля);
	
	Возврат Результат;
	
КонецФункции
